tap "homebrew/cask"

brew "mas"

brew "tree"
brew "bat"
brew "eza"
brew "git"
brew "git-extras"
brew "fzf"
brew "go"
brew "hugo"
brew "lazygit"
brew "just"
brew "joshuto"
brew "nvm"
brew "oh-my-posh"
brew "pyenv"
brew "poppler"
brew "pillow"
brew "ripgrep"
brew "tldr"
brew "neovim"
brew "asciinema"
brew "docker"

cask "showyedge"
cask "google-chrome"
cask "firefox"
cask "1password"
cask "keepingyouawake"
cask "obsidian"
cask "todoist"
cask "kitty"
cask "outline-manager"
cask "transmission"
cask "google-chrome"
cask "loom"
cask "raycast"
cask "visual-studio-code"
cask "hammerspoon"
cask "neovide"
cask "emacs-mac"
cask "slack"
cask "vlc"
cask "karabiner-elements"
cask "notion-calendar"
cask "smlnj"
cask "zed"

cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-3270-nerd-font"
cask "font-0xproto-nerd-font"
